{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [32], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_1/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_10/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_10/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_10/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_10/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_11/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_11/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_11/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_11/moving_variance"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/gamma"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/beta"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/moving_mean"}, {"dtype": "float32", "shape": [256], "name": "batch_normalization_12/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_2/moving_variance"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "batch_normalization_3/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_5/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_6/moving_variance"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_7/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_7/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_7/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_7/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_8/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_8/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_8/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_8/moving_variance"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_9/gamma"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_9/beta"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_9/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "batch_normalization_9/moving_variance"}, {"dtype": "float32", "shape": [1, 1, 1, 32], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [2, 1, 32, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [2, 1, 64, 128], "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv2d_5/kernel"}, {"dtype": "float32", "shape": [2, 1, 128, 256], "name": "conv2d_6/kernel"}, {"dtype": "float32", "shape": [65536, 5], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [5], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [1, 3, 32, 1], "name": "depthwise_conv2d_1/depthwise_kernel"}, {"dtype": "float32", "shape": [3, 1, 32, 1], "name": "depthwise_conv2d_2/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 3, 64, 1], "name": "depthwise_conv2d_3/depthwise_kernel"}, {"dtype": "float32", "shape": [3, 1, 64, 1], "name": "depthwise_conv2d_4/depthwise_kernel"}, {"dtype": "float32", "shape": [1, 3, 128, 1], "name": "depthwise_conv2d_5/depthwise_kernel"}, {"dtype": "float32", "shape": [3, 1, 128, 1], "name": "depthwise_conv2d_6/depthwise_kernel"}]}], "modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.3.0", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_1"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [1, 3], "depth_multiplier": 1}, "name": "depthwise_conv2d_1"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1]}, "name": "max_pooling2d_1"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [3, 1], "depth_multiplier": 1}, "name": "depthwise_conv2d_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_3", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2, 1]}, "name": "conv2d_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_4", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_5", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_5"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [1, 3], "depth_multiplier": 1}, "name": "depthwise_conv2d_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_3", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_6", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_6"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1]}, "name": "max_pooling2d_2"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_4", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [3, 1], "depth_multiplier": 1}, "name": "depthwise_conv2d_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_4", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_7", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2, 1]}, "name": "conv2d_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_8", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_9", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_9"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [1, 3], "depth_multiplier": 1}, "name": "depthwise_conv2d_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_5", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_10", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_10"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1]}, "name": "max_pooling2d_3"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "depthwise_conv2d_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activation": "linear", "kernel_size": [3, 1], "depth_multiplier": 1}, "name": "depthwise_conv2d_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["depthwise_conv2d_6", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_11", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_11"}, {"class_name": "Conv2D", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2, 1]}, "name": "conv2d_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_12", "alpha": 0.30000001192092896}, "name": "leaky_re_lu_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_12"}, {"class_name": "Flatten", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.3.0", "convertedBy": "TensorFlow.js Converter v1.2.9", "format": "layers-model"}